In [388]:
import numpy as np 
import pandas as pd
import seaborn as sns
from matplotlib import pyplot as plt

In [389]:
data = pd.read_csv("Data/students_data.csv", sep=",", index_col=0)

In [390]:
data.head()

,names,admission number,house,balance,english,kiswahili,mathematics,science,sst/cre,Creative Arts,music
0,"JERIEL NDEDA, OBURA",13259.0,NaN,NaN,81.0,39.0,50.0,30.0,59.0,99%,80%
1,"MUKUHA TIMOTHY, KAMAU",13243.0,NaN,NaN,85.0,74.0,68.0,49.0,78.0,38%,86%
2,"JOB, NGARA",13307.0,NaN,NaN,54.0,49.0,53.0,59.0,72.0,86%,62%
3,"CHEGE DAVID, KAMAU",13258.0,NaN,NaN,71.0,97.0,92.0,41.0,81.0,77%,80%
4,"RAMADHAN MUSA, TEPO",13363.0,NaN,NaN,40.0,84.0,74.0,82.0,89.0,64%,46%

In [391]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 147 entries, 0 to 146
Data columns (total 11 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   names             147 non-null    object
 1   admission number  124 non-null    float64
 2   house             26 non-null     object
 3   balance           58 non-null     object
 4   english           121 non-null    float64
 5   kiswahili         119 non-null    float64
 6   mathematics       130 non-null    float64
 7   science           117 non-null    float64
 8   sst/cre           132 non-null    float64
 9   Creative Arts     143 non-null    object
 10  music             147 non-null    object
dtypes: float64(6), object(5)
memory usage: 13.8+ KB

In [392]:
data.shape

(147, 11)

In [393]:
data.columns

Index(['names', 'admission number', 'house', 'balance', 'english', 'kiswahili',
       'mathematics', 'science', 'sst/cre', 'Creative Arts', 'music'],
      dtype='object')

## Duplicates and Unwanted Observations

In [394]:
data.duplicated(subset=None, keep='first').any()

True

In [395]:
data.duplicated().value_counts()

False    139
True       8
Name: count, dtype: int64

In [396]:
data.drop_duplicates(subset=None, keep="first", inplace=True)

In [397]:
data.shape

(139, 11)

In [398]:
data.drop(columns=["house"], inplace=True)

## Missing values

In [399]:
data.isnull()

,names,admission number,balance,english,kiswahili,mathematics,science,sst/cre,Creative Arts,music
0,False,False,True,False,False,False,False,False,False,False
1,False,False,True,False,False,False,False,False,False,False
2,False,False,True,False,False,False,False,False,False,False
3,False,False,True,False,False,False,False,False,False,False
4,False,False,True,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...
142,False,False,False,False,False,False,False,False,False,False
143,False,False,False,False,False,False,False,False,False,False
144,False,False,False,False,False,False,False,False,False,False
145,False,False,True,False,False,False,False,False,False,False
146,False,False,True,False,False,False,False,False,False,False

In [400]:
# Summary of missing values 

data.isnull().any()

names               False
admission number     True
balance              True
english              True
kiswahili            True
mathematics          True
science              True
sst/cre              True
Creative Arts        True
music               False
dtype: bool

In [401]:
# to check for specific column

data["english"].isnull().any()

True

In [402]:
# checking for number of missing values

data.isnull().sum()

names                0
admission number    23
balance             82
english             26
kiswahili           28
mathematics         17
science             30
sst/cre             15
Creative Arts        4
music                0
dtype: int64

In [403]:
# sorting (descending)
data.isnull().sum().sort_values(ascending=False)

balance             82
science             30
kiswahili           28
english             26
admission number    23
mathematics         17
sst/cre             15
Creative Arts        4
names                0
music                0
dtype: int64

In [404]:
# checking the ratios of the missing data

(data.isnull().sum() / len(data)).sort_values(ascending=False)

balance             0.589928
science             0.215827
kiswahili           0.201439
english             0.187050
admission number    0.165468
mathematics         0.122302
sst/cre             0.107914
Creative Arts       0.028777
names               0.000000
music               0.000000
dtype: float64

In [405]:
data.dtypes

names                object
admission number    float64
balance              object
english             float64
kiswahili           float64
mathematics         float64
science             float64
sst/cre             float64
Creative Arts        object
music                object
dtype: object

In [406]:
# Assuming that students with missing balances have cleared fees (fee balance is zero), we replace the blank with 0

data["balance"].replace(to_replace=np.NaN, value="0", inplace=True, regex=True) # replace missing values with 0 and treat them as strings

In [407]:
data.isnull().sum()

names                0
admission number    23
balance              0
english             26
kiswahili           28
mathematics         17
science             30
sst/cre             15
Creative Arts        4
music                0
dtype: int64

In [408]:
data.columns

Index(['names', 'admission number', 'balance', 'english', 'kiswahili',
       'mathematics', 'science', 'sst/cre', 'Creative Arts', 'music'],
      dtype='object')

In [409]:
subjects_num = ['english', 'kiswahili', 'mathematics', 'science', 'sst/cre']

for col in subjects_num:
    data[col].replace(to_replace=np.NaN, value=data[col].mean(), inplace=True)

In [410]:
data.isnull().sum()

names                0
admission number    23
balance              0
english              0
kiswahili            0
mathematics          0
science              0
sst/cre              0
Creative Arts        4
music                0
dtype: int64

In [411]:
# From above, only admission number and Creative arts have missing values

In [412]:
# removing % sign from creative arts
data["Creative Arts"].str.strip("%")

0       99
1       38
2       86
3       77
4       64
      ...
142    99&
143     56
144     49
145     88
146     76
Name: Creative Arts, Length: 139, dtype: object

In [413]:
data["Creative Arts"] = data["Creative Arts"].str.strip("%")
data["music"] = data["music"].str.strip("%")

In [414]:
data.head()

,names,admission number,balance,english,kiswahili,mathematics,science,sst/cre,Creative Arts,music
0,"JERIEL NDEDA, OBURA",13259.0,0,81.0,39.0,50.0,30.0,59.0,99,80
1,"MUKUHA TIMOTHY, KAMAU",13243.0,0,85.0,74.0,68.0,49.0,78.0,38,86
2,"JOB, NGARA",13307.0,0,54.0,49.0,53.0,59.0,72.0,86,62
3,"CHEGE DAVID, KAMAU",13258.0,0,71.0,97.0,92.0,41.0,81.0,77,80
4,"RAMADHAN MUSA, TEPO",13363.0,0,40.0,84.0,74.0,82.0,89.0,64,46

In [415]:
data["Creative Arts"].replace(to_replace = np.NaN, value= data["Creative Arts"].mode(), inplace=True, regex=True)

ValueError: Series.replace cannot use dict-value and non-None to_replace